analysis/perf-optimize3/runs/s5_on_dff94fca/goopg_N.pgbench.txt
pgbench (18.3)
starting vacuum...end.
progress: 30.0 s, 1457.6 tps, lat 34.273 ms stddev 30.487, 0 failed
progress: 60.0 s, 1822.1 tps, lat 27.434 ms stddev 15.126, 0 failed
progress: 90.0 s, 1876.6 tps, lat 26.651 ms stddev 14.095, 0 failed
transaction type: <builtin: simple update>
scaling factor: 100
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 120 s
number of transactions actually processed: 211797
number of failed transactions: 0 (0.000%)
latency average = 28.327 ms
latency stddev = 18.925 ms
initial connection time = 6.362 ms
tps = 1764.986561 (without initial connection time)
statement latencies in milliseconds and failures:
         0.001           0 \set aid random(1, 100000 * :scale)
         0.000           0 \set bid random(1, 1 * :scale)
         0.000           0 \set tid random(1, 10 * :scale)
         0.000           0 \set delta random(-5000, 5000)
         0.260           0 BEGIN;
         1.019           0 UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         0.232           0 SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         0.881           0 INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        25.963           0 END;